amarildolacerda/homeware/clients/esp8266_lampada/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <EEPROM.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include <espnow.h>
#include <Espalexa.h>
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"

static const char *TAG = "esp8266-lampada";

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;
static unsigned long s_last_alexa_activity = 0;
static unsigned long s_send_deadline = 0;
static int s_send_retries_left = 0;
static unsigned long s_pair_wait_until = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;

static bool s_relay_state = false;
static int s_relay_pin = RELAY_PIN;
static int s_button_pin = BUTTON_PIN;
static int s_battery = 100;
static bool s_button_last = HIGH;
static unsigned long s_button_last_ms = 0;
static unsigned long s_start_time = 0;
static unsigned long s_last_send_ms = 0;

static char s_device_id[32];
static char s_device_name[48] = DEVICE_NAME;

static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;
static bool s_use_repeater = false;
static uint8_t s_my_mac[6];

static ESP8266WebServer s_server(DASHBOARD_PORT);
static Espalexa s_alexa;
static EspalexaDevice *s_alexa_dev = nullptr;

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_RELAY_STATE_ADDR (EEPROM_NAME_ADDR + EEPROM_NAME_MAX + 1)
#define EEPROM_RELAY_PIN_ADDR (EEPROM_RELAY_STATE_ADDR + 1)
#define EEPROM_BUTTON_PIN_ADDR (EEPROM_RELAY_PIN_ADDR + 1)
#define EEPROM_MAGIC 0xAA

static void save_gateway_mac(const uint8_t *mac)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_GATEWAY_MAC_ADDR, EEPROM_MAGIC);
    for (int i = 0; i < 6; i++)
        EEPROM.write(EEPROM_GATEWAY_MAC_ADDR + 1 + i, mac[i]);
    EEPROM.commit();
    EEPROM.end();
}

static bool load_gateway_mac(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_GATEWAY_MAC_ADDR);
    if (marker == EEPROM_MAGIC)
    {
        for (int i = 0; i < 6; i++)
            s_gateway_mac[i] = EEPROM.read(EEPROM_GATEWAY_MAC_ADDR + 1 + i);
        EEPROM.end();
        char mac_str[18];
        mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
        Serial.printf("[%s] Loaded gateway MAC: %s\n", TAG, mac_str);
        return true;
    }
    EEPROM.end();
    return false;
}

static void save_relay_state(void)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_RELAY_STATE_ADDR, s_relay_state ? 1 : 0);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_state(void)
{
    EEPROM.begin(128);
    uint8_t val = EEPROM.read(EEPROM_RELAY_STATE_ADDR);
    EEPROM.end();
    s_relay_state = (val == 1);
}

static void save_relay_pin(void)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_RELAY_PIN_ADDR, (uint8_t)s_relay_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_relay_pin(void)
{
    EEPROM.begin(128);
    uint8_t val = EEPROM.read(EEPROM_RELAY_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_relay_pin = (int)val;
                return;
            }
        }
    }
}

static void save_button_pin(void)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_BUTTON_PIN_ADDR, (uint8_t)s_button_pin);
    EEPROM.commit();
    EEPROM.end();
}

static void load_button_pin(void)
{
    EEPROM.begin(128);
    uint8_t val = EEPROM.read(EEPROM_BUTTON_PIN_ADDR);
    EEPROM.end();
    if (val != 0xFF)
    {
        for (int i = 0; i < AVAILABLE_GPIOS_COUNT; i++)
        {
            if (AVAILABLE_GPIOS[i] == (int)val)
            {
                s_button_pin = (int)val;
                return;
            }
        }
    }
}

static void save_device_name(const char *name)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_NAME_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_NAME_ADDR + 1 + i, name[i]);
        if (name[i] == '\0') break;
    }
    EEPROM.write(EEPROM_NAME_ADDR + EEPROM_NAME_MAX, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool is_valid_name(const char *s)
{
    if (!s || s[0] == '\0') return false;
    for (int i = 0; s[i]; i++)
    {
        char c = s[i];
        if (c < 32 || c > 126) return false;
    }
    return true;
}

static void load_device_name(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_NAME_ADDR);
    if (marker == 0xFF)
    {
        char buf[EEPROM_NAME_MAX];
        for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_NAME_ADDR + 1 + i);
            if (buf[i] == '\0') break;
        }
        buf[EEPROM_NAME_MAX - 1] = '\0';
        if (is_valid_name(buf))
        {
            strncpy(s_device_name, buf, sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
        }
    }
    EEPROM.end();
}

static bool mac_parse(const char *str, uint8_t *mac)
{
    int vals[6];
    if (sscanf(str, "%x:%x:%x:%x:%x:%x",
               &vals[0], &vals[1], &vals[2],
               &vals[3], &vals[4], &vals[5]) != 6)
        return false;
    for (int i = 0; i < 6; i++)
        mac[i] = (uint8_t)vals[i];
    return true;
}

static void set_relay(bool state);

static void name_to_ssid(const char *name, char *out, size_t max)
{
    size_t j = 0;
    for (size_t i = 0; name[i] && j < max - 1; i++)
    {
        char c = name[i];
        if (c >= 32 && c <= 126 && c != '"' && c != '\\')
            out[j++] = c;
    }
    while (j > 0 && out[j - 1] == ' ') j--;
    if (j == 0)
    {
        strncpy(out, "Lampada", max - 1);
        out[max - 1] = '\0';
        return;
    }
    out[j] = '\0';
}

extern "C" void espnow_send_cb(uint8_t *mac, uint8_t status)
{
    (void)mac;
    (void)status;
}

extern "C" void espnow_recv_cb(uint8_t *mac, uint8_t *data, uint8_t len)
{
    if (!data || len < 1) return;

    switch (data[0])
    {
        case ESPNOW_MSG_PAIR_RESPONSE:
        {
            if (len < sizeof(espnow_pair_response_t)) return;
            espnow_pair_response_t *resp = (espnow_pair_response_t *)data;
            if (resp->status == PAIR_STATUS_OK)
            {
                if (!s_use_repeater)
                {
                    mac_copy(s_gateway_mac, mac);
                    save_gateway_mac(mac);
                }
                s_assigned_slot = resp->assigned_slot;
                s_paired = true;
                s_gateway_connected = true;
                char mac_str[18];
                mac_to_str(mac, mac_str, sizeof(mac_str));
                Serial.printf("[%s] Paired with gateway %s slot %d\n", TAG, mac_str, s_assigned_slot);
            }
            else
            {
                Serial.printf("[%s] Pair response: status=%d\n", TAG, resp->status);
            }
            break;
        }
        case ESPNOW_MSG_COMMAND:
        {
            if (len < sizeof(espnow_command_t)) return;
            espnow_command_t *cmd = (espnow_command_t *)data;
            if (mac_equal(cmd->target_mac, s_my_mac))
            {
                Serial.printf("[%s] Command for me: state=%d\n", TAG, cmd->command);
                set_relay(cmd->command ? true : false);
            }
            break;
        }
        case ESPNOW_MSG_ACK:
        {
            if (len < sizeof(espnow_ack_t)) return;
            espnow_ack_t *ack = (espnow_ack_t *)data;
            if (ack->status == PAIR_STATUS_DENIED)
            {
                s_paired = false;
                s_gateway_connected = false;
                Serial.printf("[%s] Gateway rejected data (denied), need re-pair\n", TAG);
            }
            else
            {
                s_gateway_connected = true;
            }
            s_ack_received = true;
            break;
        }
    }

    /* Repeater: forward messages between clients and gateway */
    if (s_paired)
    {
        if (mac_equal(mac, s_gateway_mac))
        {
            /* From gateway → broadcast (other devices check target_mac) */
            esp_now_send(s_broadcast_mac, data, len);
        }
        else
        {
            /* From client → forward to gateway */
            esp_now_send(s_gateway_mac, data, len);
        }
    }
}

static bool espnow_init_client(void)
{
    if (esp_now_init() != 0)
    {
        Serial.printf("[%s] ESP-NOW init failed\n", TAG);
        return false;
    }
    esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
    esp_now_register_send_cb(espnow_send_cb);
    esp_now_register_recv_cb(espnow_recv_cb);
    s_espnow_ready = true;
    Serial.printf("[%s] ESP-NOW initialized\n", TAG);
    return true;
}

static bool espnow_add_peer(const uint8_t *mac)
{
    if (!s_espnow_ready) return false;
    esp_now_del_peer((uint8_t *)mac);
    int ch = ESP_NOW_CHANNEL;
    int ret = esp_now_add_peer((uint8_t *)mac, ESP_NOW_ROLE_COMBO, ch, NULL, 0);
    if (ret != 0)
    {
        char mac_str[18];
        mac_to_str(mac, mac_str, sizeof(mac_str));
        Serial.printf("[%s] Failed to add peer %s: %d\n", TAG, mac_str, ret);
    }
    return (ret == 0);
}

